espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/io_mux_reg.h
#define PERIPHS_IO_MUX_U_PAD_GPIO53               (REG_IO_MUX_BASE + 0xD8)
#define FUNC_GPIO53_DBG_FLASH_CK_PAD                                      4
#define FUNC_GPIO53_EMAC_PHY_RXD1_PAD                                    3
#define FUNC_GPIO53_GPIO53                                               1
#define FUNC_GPIO53_GPIO53_0                                             0

#define PERIPHS_IO_MUX_U_PAD_GPIO54               (REG_IO_MUX_BASE + 0xDC)
#define FUNC_GPIO54_DBG_FLASH_D_PAD                                       4
#define FUNC_GPIO54_EMAC_PHY_RXER_PAD                                    3
#define FUNC_GPIO54_GPIO54                                               1
#define FUNC_GPIO54_GPIO54_0                                             0

#define PERIPHS_IO_MUX_U_PAD_GPIO55               (REG_IO_MUX_BASE + 0xE0)
#define FUNC_GPIO55_GPIO55                                               1
#define FUNC_GPIO55_GPIO55_0                                             0

#define PERIPHS_IO_MUX_U_PAD_GPIO56               (REG_IO_MUX_BASE + 0xE4)
#define FUNC_GPIO56_GPIO56                                               1
#define FUNC_GPIO56_GPIO56_0                                             0

#define IO_MUX_DATE_REG          (REG_IO_MUX_BASE + 0x104)
/* IO_MUX_DATE : R/W ;bitpos:[27:0] ;default: 27'h0201222 ; */
/*description: csv date.*/
#define IO_MUX_DATE    0x0FFFFFFF
#define IO_MUX_DATE_M  ((IO_MUX_DATE_V)<<(IO_MUX_DATE_S))
#define IO_MUX_DATE_V  0xFFFFFFF
#define IO_MUX_DATE_S  0
